# [접근자 Accessor]
- Series/DF의 데이터가 날짜시간(datetme), 문자열(object), 범주형(category) 등의 경우 데이터 타입과 관련된 전용의 함수들을 사용할 수 있도록 해주는 속성
- SR.str.문자열처리관련함수명()
- SR.dt.날짜시간처리관련속성명()

## <hr> 1. 모듈로딩

In [26]:
import pandas as pd

## <hr> 2. 데이터 준비

In [27]:
datas1 = {"name":["홍 길동", "이 나영", "마 징가", "베 토벤"],
        "age" : [10, 21, 73, 89],
        "reg_date" : ["2000/1/23", "1991/11/8", "2001/5/8", "1900/11/12"]}
datas2 = [["홍 길동", "이 나영", "마 징가", "베 토벤"],
        [10, 21, 73, 89],
        ["2000/1/23", "1991/11/8", "2001/5/8", "1900/11/12"]]

## <hr> 3. 데이터 저장

In [28]:
# Dict -> DF
df1 = pd.DataFrame(datas1)
df1

   name  age    reg_date
0  홍 길동   10   2000/1/23
1  이 나영   21   1991/11/8
2  마 징가   73    2001/5/8
3  베 토벤   89  1900/11/12

In [29]:
# List -> DF
df2 = pd.DataFrame(datas2)
df2

           0          1         2           3
0       홍 길동       이 나영      마 징가        베 토벤
1         10         21        73          89
2  2000/1/23  1991/11/8  2001/5/8  1900/11/12

## <hr> 4. 데이터 정보 확인

In [30]:
# 데이터의 전체 기본 정보 확인
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      4 non-null      object
 1   age       4 non-null      int64
 2   reg_date  4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

## <hr> 5. 데이터 전처리

In [31]:
df1.transpose()

                  0          1         2           3
name           홍 길동       이 나영      마 징가        베 토벤
age              10         21        73          89
reg_date  2000/1/23  1991/11/8  2001/5/8  1900/11/12

In [32]:
df1.columns = [0, 1, 2]
df1

      0   1           2
0  홍 길동  10   2000/1/23
1  이 나영  21   1991/11/8
2  마 징가  73    2001/5/8
3  베 토벤  89  1900/11/12

In [33]:
# 1번 컬럼 : object => 정수 
df1[1] = df1[1].astype("uint8")

In [34]:
df1[1].dtypes

dtype('uint8')

In [35]:
# 2번 컬럼 : object -> datetme64[ns] (astype 혹은 to_datetime)
df1[2] = df1[2].astype("datetime64[ns]")

In [36]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       4 non-null      object
 1   1       4 non-null      uint8
 2   2       4 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(1), uint8(1)
memory usage: 200.0+ bytes

In [37]:
df1.dtypes

0            object
1             uint8
2    datetime64[ns]
dtype: object

In [38]:
# 0번 컬럼 성과 이름으로 구분하기 
nameSR = df1[0] # SR

In [39]:
type(nameSR[1])

str

In [40]:
nameSR[1].split()

['이', '나영']

In [41]:
'''
for idx in range(nameSR.shape[0]):
    nameSR[idx] = nameSR[idx].split()
nameSR
'''

'\nfor idx in range(nameSR.shape[0]):\n    nameSR[idx] = nameSR[idx].split()\nnameSR\n'

In [44]:
#for n in  df1[0]:
  #  f, b = n.split()
names = nameSR.str.split(expand=True)
names

   0   1
0  홍  길동
1  이  나영
2  마  징가
3  베  토벤

In [45]:
df1

      0   1          2
0  홍 길동  10 2000-01-23
1  이 나영  21 1991-11-08
2  마 징가  73 2001-05-08
3  베 토벤  89 1900-11-12

우리의 목적은 df1에 0번을 names로 바꿔치기 하는 것

### 5-(4) 2개의 데이터 프레임을 컬럼방향으로 연결하고 싶음

In [51]:
pd.concat([df1, names], axis=True)

      0   1          2  0   1
0  홍 길동  10 2000-01-23  홍  길동
1  이 나영  21 1991-11-08  이  나영
2  마 징가  73 2001-05-08  마  징가
3  베 토벤  89 1900-11-12  베  토벤

In [52]:
pd.concat([df1, names], axis=True, ignore_index=True)

      0   1          2  3   4
0  홍 길동  10 2000-01-23  홍  길동
1  이 나영  21 1991-11-08  이  나영
2  마 징가  73 2001-05-08  마  징가
3  베 토벤  89 1900-11-12  베  토벤

### 5-(5) 2번 커럼에서 년/월/일을 분리

In [53]:
df1[2]

0   2000-01-23
1   1991-11-08
2   2001-05-08
3   1900-11-12
Name: 2, dtype: datetime64[ns]

In [55]:
yearSR = df1[2].dt.year
monthSR = df1[2].dt.month
daySR = df1[2].dt.day

In [63]:
pd.concat([df1, yearSR, monthSR, daySR], axis=True, ignore_index=1).drop(2, axis=1)

      0   1     3   4   5
0  홍 길동  10  2000   1  23
1  이 나영  21  1991  11   8
2  마 징가  73  2001   5   8
3  베 토벤  89  1900  11  12

### 5-(6) 현재 DataFrame을 파일로 저장하기 =. pandas_to_xxx("파일경로+파일명")

In [71]:
# csv ==> 데이터와 데이터의 구분자
filename="./backup.csv" # 현재 파일이니까 걍 backup.csv해도 됨

In [72]:
df1.to_csv(filename, sep = " ")